; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v6 - type_2 ?v7 - type_3)
 	      (pred_1 ?v1 - object ?v7 - type_3)
	      (pred_3 ?v6 - type_2 ?v4 - type_1)
	      (pred_4 ?v6 - type_2 ?v1 - object ?v4 - type_1))

   (:action op_1
       :parameters  (?v6 - type_2 ?v3 ?v2 - type_3)
       :precondition (and  (pred_2 ?v6 ?v3))
       :effect (and  (pred_2 ?v6 ?v2)
		     (not (pred_2 ?v6 ?v3))))

   (:action op_2
       :parameters (?v6 - type_2 ?v8 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v5) (pred_2 ?v6 ?v5) (pred_3 ?v6 ?v4))
       :effect (and (pred_4 ?v6 ?v8 ?v4)
		    (not (pred_1 ?v8 ?v5)) 
		    (not (pred_3 ?v6 ?v4))))

   (:action op_3
       :parameters (?v6 - type_2 ?v8 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v8 ?v4) (pred_2 ?v6 ?v5))
       :effect (and (pred_1 ?v8 ?v5)
		    (pred_3 ?v6 ?v4)
		    (not (pred_4 ?v6 ?v8 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_03 - type_2
obj_04 obj_13 obj_10 obj_08 - type_1
obj_11 obj_12 obj_06 obj_01 - type_3
obj_14 obj_05 obj_09 obj_07 - object)
(:init
(pred_2 obj_02 obj_12)
(pred_3 obj_02 obj_04)
(pred_3 obj_02 obj_13)
(pred_2 obj_03 obj_01)
(pred_3 obj_03 obj_10)
(pred_3 obj_03 obj_08)
(pred_1 obj_14 obj_12)
(pred_1 obj_05 obj_06)
(pred_1 obj_09 obj_12)
(pred_1 obj_07 obj_11)
)
(:goal
(and
(pred_1 obj_14 obj_06)
(pred_1 obj_05 obj_11)
(pred_1 obj_09 obj_12)
(pred_1 obj_07 obj_01)
)
)

(:constraints
  (always (not (pred_2 obj_02 obj_06)))
)
)

; plan
1. (op_2 obj_02 obj_14 obj_12 obj_13)
   deleted: (pred_1 obj_14 obj_12) (pred_3 obj_02 obj_13)
   added: (pred_4 obj_02 obj_14 obj_13)
   goals met: 1 of 4
2. (op_1 obj_03 obj_01 obj_11)
   deleted: (pred_2 obj_03 obj_01)
   added: (pred_2 obj_03 obj_11)
   goals met: 1 of 4
3. (op_2 obj_03 obj_07 obj_11 obj_08)
   deleted: (pred_1 obj_07 obj_11) (pred_3 obj_03 obj_08)
   added: (pred_4 obj_03 obj_07 obj_08)
   goals met: 1 of 4
4. (op_1 obj_02 obj_12 obj_11)
   deleted: (pred_2 obj_02 obj_12)
   added: (pred_2 obj_02 obj_11)
   goals met: 1 of 4
5. (op_1 obj_03 obj_11 obj_01)
   deleted: (pred_2 obj_03 obj_11)
   added: (pred_2 obj_03 obj_01)
   goals met: 1 of 4
6. (op_3 obj_02 obj_14 obj_11 obj_13)
   deleted: (pred_4 obj_02 obj_14 obj_13)
   added: (pred_1 obj_14 obj_11) (pred_3 obj_02 obj_13)
   goals met: 1 of 4
7. (op_3 obj_03 obj_07 obj_01 obj_08)
   deleted: (pred_4 obj_03 obj_07 obj_08)
   added: (pred_1 obj_07 obj_01) (pred_3 obj_03 obj_08)
   goals met: 2 of 4
8. (op_1 obj_03 obj_01 obj_06)
   deleted: (pred_2 obj_03 obj_01)
   added: (pred_2 obj_03 obj_06)
   goals met: 2 of 4
9. (op_2 obj_03 obj_05 obj_06 obj_08)
   deleted: (pred_1 obj_05 obj_06) (pred_3 obj_03 obj_08)
   added: (pred_4 obj_03 obj_05 obj_08)
   goals met: 2 of 4
10. (op_1 obj_03 obj_06 obj_11)
   deleted: (pred_2 obj_03 obj_06)
   added: (pred_2 obj_03 obj_11)
   goals met: 2 of 4
11. (op_3 obj_03 obj_05 obj_11 obj_08)
   deleted: (pred_4 obj_03 obj_05 obj_08)
   added: (pred_1 obj_05 obj_11) (pred_3 obj_03 obj_08)
   goals met: 3 of 4
12. (op_2 obj_03 obj_14 obj_11 obj_08)
   deleted: (pred_1 obj_14 obj_11) (pred_3 obj_03 obj_08)
   added: (pred_4 obj_03 obj_14 obj_08)
   goals met: 3 of 4
13. (op_1 obj_03 obj_11 obj_06)
   deleted: (pred_2 obj_03 obj_11)
   added: (pred_2 obj_03 obj_06)
   goals met: 3 of 4
14. (op_3 obj_03 obj_14 obj_06 obj_08)
   deleted: (pred_4 obj_03 obj_14 obj_08)
   added: (pred_1 obj_14 obj_06) (pred_3 obj_03 obj_08)
   goals met: 4 of 4
